# 1. 1,3,5,7,9,11,13,15,17,19,21
n = 1
while n <= 21:
    print(n, end=', ')
    n += 2

print()  # เพื่อขึ้นบรรทัดใหม่

# 2. 2,5,8,11,13,14,17
n = 2
while n <= 17:
    print(n, end=', ')
    n += 3

print()

# 3. 100,90,80,70,60,50,40,30,20,10,0,-10,-20,-30,-40,-50,-60,-70,-80,-90,-100
n = 100
while n >= -100:
    print(n, end=', ')
    n -= 10

print()

# 4. -30,-20-10,0,10,20,30
n = -30
while n <= 30:
    print(n, end=', ')
    n += 10

print()

# 5. 15,23,31,39,47,55
n = 15
while n <= 55:
    print(n, end=', ')
    n += 8